fix architecture.md graph of system components
